{
  "pdf_source": "FINAL OF FINAL.pdf",
  "extraction_timestamp": "2025-09-03T13:29:44.921963",
  "technical_concepts": {
    "indicators": {
      "rsi": {
        "name": "RSI",
        "mentions": 20,
        "context": "trường bull: ( bò) giá lên thị trường bear( gấu) giá xuống - đó là 2 con vật biểu tượng phố wall RSI là chỉ số đo lường sức mạnh thị trường - cái này dùng trong kỹ thuật, nói sau ĐÂY LÀ CÂU HỎI MÀ ĐẾ"
      },
      "macd": {
        "name": "MACD",
        "mentions": 9,
        "context": "817957860378 371/652 Sơn Việt 2/15/18 437 Cái indicators ở dưới là gì thế ad Tài Phạm 2/15/18 467 MACD Nguyên Phạm 2/15/18 467 macd hoặc RSI đều được đúng ko jess Jesse Livermore J.L 2/15/18 468 MACD"
      },
      "bollinger": {
        "name": "BOLLINGER",
        "mentions": 24,
        "context": "ề các indicator và hệ thống giao dịch,các diễn đàn thảo luận( Tôi nhớ không nhầm lúc đó là công cụ Bollinger Bands và Stoch,RSI đơn giản vì nó quá dễ nắm bắt , tiếp sau đó là hệ thống Ichimoku dây dợ nhằng"
      },
      "stochastic": {
        "name": "STOCHASTIC",
        "mentions": 3,
        "context": "ệ thống giao dịch,các diễn đàn thảo luận( Tôi nhớ không nhầm lúc đó là công cụ Bollinger Bands và Stoch,RSI đơn giản vì nó quá dễ nắm bắt , tiếp sau đó là hệ thống Ichimoku dây dợ nhằng nhịt, rồi chuyển"
      },
      "ema": {
        "name": "EMA",
        "mentions": 13,
        "context": "0378 95/652 TT 11:19:09 AM Chiều xuống đang diễn ra xu thế c2 đang diễn ra Về lý thuyết đã chạm EMA34. Nó sẽ bật lên. Nếu phá 34. Phá trend thì điểm tiếp theo cần quan sát là vùng đáy gần nhất. Mond"
      },
      "sma": {
        "name": "SMA",
        "mentions": 1,
        "context": "S ĐỘI NÀO THÍCH MMO ĐỘI NÀO THÍCH TRADE THEO TAO PHI LỢI NHUẬN ONLINE CHƯA BAO GIỜ TAO VẼ CHO CHUNG SMAYF 1 MÀU HỒNG CÔNG NHẬN KO? MÀ DKM TOÀN MÀU XÁM XỊT VỀ NGHIỆP TRADE CHƯA BAO GIỜ VẼ LÀ. DKM THEO KÈO"
      },
      "adx": {
        "name": "ADX",
        "mentions": 2,
        "context": "ạn kiểm tra các Robot giao dịch, bạn dùng đủ loại MA, Fibo, S/R,Pivots, Fractals, Divergence, DMI, ADX… và hàng trăm ngàn thứ khác nữa với hy vọng rằng hệ thống “độc nhất vô nhị” của mình sẽ phát huy"
      },
      "atr": {
        "name": "ATR",
        "mentions": 2,
        "context": "mày dạy t với vì t thấy cứ để khơi khơi thế mà đưa vào thì sml nhìu hơn là chính xác Bangiamhieunhatruong 2/15/18 409 Mọi thứ đều là xác suất. Nó phải đc thừa nhận thì mới bán đc Ryan Phạm 2/15/18 44"
      }
    },
    "patterns": {
      "flag": {
        "name": "Flag",
        "mentions": 1,
        "context": "MÔ HÌNH ? Ý MÀY LÀ THẾ? CÓ TỶ MÔ HÌNH CỐC TAY CẦM VAI ĐẦU VAI BƯỚM CUA MẸ BỒNG CON CỜ ĐUÔI NHEO CỜ FLAG MÔ HÌNH NÊM WOLFWAVE SÓNG 2 ĐỈNH 2 ĐÁY 3 ĐỈNH 3 ĐÁY VÂN VÂN VÀ MÂY MÂY 5/11/2018 Telegram Web https"
      },
      "channel": {
        "name": "Channel",
        "mentions": 20,
        "context": "41747_16250773817957860378 1/652 Waiting for network Retry TT 11:05:47 PM Tuesday, January 16, 2018 Channel created THƯ VIỆN LỚP BỔ TÚC Jesse Livermore J.L 1/16/18 27K LỘ TRÌNH HỌC: BÀI MỘT: TẨY NÃO BÀI"
      }
    },
    "strategies": {
      "breakout": {
        "name": "Breakout",
        "mentions": 3,
        "context": "ỨNG THƯ VIỆN LỚP BỔ TÚC MUA ĐỈNH BÁN ĐÁY 1/19/18 1.3K Mày thường vào lệnh lúc nào Dow : khi giá đã breakout vùng giá trước đó trong uptrend hay khi thị trường đổ máu? Downcome 1/19/18 1.4K CÁCH TAO VÀO LỆ"
      },
      "scalping": {
        "name": "Scalping",
        "mentions": 1,
        "context": "ÙNG 1 THỜI ĐIỂM. CÙNG 1 NGƯỠNG CHỊU ĐỰNG THÌ NHƯ VẬY TAO CHỈ NHẮC CHÚNG MÀY THỜI KỲ NÀY LÀ THỜI KỲ SCALPING LƯỚT SÓNG. ĐÉO PHẢI THỜI KỲ HOLD DÀI. HOLD DÀI CHỈ DÀNH CHO THỜI KỲ CỨ NHẮM MẮT MÚC LÀ ĂN. MÀ THỜ"
      }
    },
    "risk_management": {
      "stop_loss": {
        "name": "Stop Loss",
        "mentions": 7,
        "context": "thì a downcome đang nói riêng về phần trade, còn hold thì khác. Khi trade thì cần tuân thủ kỷ luật stop loss do mình đề ra. Khi hold thì dù nó có giảm nhưng vì mình định giá nó cao nên mình vẫn hold để đợi"
      }
    },
    "advanced_techniques": {
      "elliot_wave": {
        "name": "Elliot Wave",
        "mentions": 2,
        "context": "Ế CUỘC SỐNG CM GIÚP CM GIỮ ĐC TIỀN CÒN NẾU CHUYÊN SÂU HƠN THÌ CÓ THỂ ÁP DỤNG BÒ GẤU TRONG PHÂN TÍCH ELLIOTT WAVES TRONG BIỂU ĐỒ Ở ĐÂY TAO ĐÉO DẠY CM CHÉN THÁNH ĐÉO CÓ GÌ CHẮC ĂN 100% CẢ TAO CHỈ DẠY CHÚNG MÀY CÁCH"
      },
      "fibonacci": {
        "name": "Fibonacci",
        "mentions": 36,
        "context": "KO PHẢI LÚC NÀO CŨNG CỨ PHÁ ĐỈNH LÀ LÊN, PHÁ ĐÁY LÀ XUỐNG CHÚNG MÀY CẦN ĐC HỌC THÊM PHÂN KỲ HỘI TỤ FIBONACCI GT 5/11/2018 Telegram Web https://web.telegram.org/#/im?p=c1337841747_16250773817957860378 11/652 M"
      },
      "harmonic_patterns": {
        "name": "Harmonic Patterns",
        "mentions": 1,
        "context": "ỢP VỚI GEOMETRY KIỂU NÀY, CHỈ LÀ CÁI TRẠNG THÁI ... ĐOÁN MÒ NÓ ÉO CÓ ĐƯỢC VUI LẮM =)) TAO HAY DÙNG HARMONIC, ELLIOTT ĐA PHẦN LÀ GEOMETRY Jesse Livermore J.L 3/16/18 1.6K 1 SỰ THẬT LÀ GANN ĐÉO GIÀU TỪ GIAO D"
      }
    }
  },
  "trading_strategies": {},
  "risk_management": {},
  "summary": {
    "total_concepts": 16,
    "total_strategies": 0,
    "total_risk_factors": 0
  }
}